from termcolor import colored, cprint
print(f"*************************************************************************")
print(colored("Метод главного критерия", "green"))
print(colored(f"f1 - главная ЦФ, f2 - стала ограничением", 'blue'))
print(colored(f"""
    x1 = 7
    x2 = 4,5
    f1 = -9,5
""", "red"))
print(f"*************************************************************************")
print(colored("f2 - главная ЦФ, f2 - стала ограничением", "blue"))
print(colored(f"""
    x1 = 4
    x2 = 0
    f1 = 4
""", "red"))
print(f"*************************************************************************")
print(colored("Метод максимальной свертки", "green"))
print(colored("Максимальное значение функции f1=2", "blue"))
print(colored("Достигается при x1 = 0, x2 = 2", "blue"))
# print(f"*************************************************************************")
# print(colored("Метод линейной свертки", "green"))
# print(colored("""
#     a) Решение не найдено
#     b) Решение не найдено
#     с) Максимальное значение ф-ции G(x): 15.76
#     На коэффициентах а1 = 0.01, а2 = 0.99
#     х1 = 1, х2 = 6
#     k = 5
#     d) Решение не найдено
# """, "blue"))
#
# print(colored(""))
